/// 舍入模式
///
/// ## Notes
/// - 用于控制在截断小数时的取整规则
/// - 设原始值为 `x`，目标结果为保留 0 位小数时的值
#[derive(Clone, Copy, Debug, PartialEq, Eq)]
pub enum RoundingMode {
    /// 向零方向舍入（截断）
    ///
    /// ## Examples
    /// -  2.7  →  2
    /// - -2.7  → -2
    Down,

    /// 远离零方向舍入
    ///
    /// ## Examples
    /// -  2.1  →  3
    /// - -2.1  → -3
    Up,

    /// 向负无穷方向舍入
    ///
    /// ## Examples
    /// -  2.7  →  2
    /// - -2.1  → -3
    Floor,

    /// 向正无穷方向舍入
    ///
    /// ## Examples
    /// -  2.1  →  3
    /// - -2.7  → -2
    Ceiling,

    /// 四舍五入（5 向上）
    ///
    /// ## Examples
    /// -  2.4  →  2
    /// -  2.5  →  3
    /// - -2.5  → -3
    HalfUp,

    /// 四舍五入（5 向零）
    ///
    /// ## Examples
    /// -  2.5  →  2
    /// -  2.6  →  3
    /// - -2.5  → -2
    HalfDown,

    /// 银行家舍入（5 向最近的偶数）
    ///
    /// ## Examples
    /// -  2.5  →  2
    /// -  3.5  →  4
    /// -  4.5  →  4
    /// - -2.5  → -2
    HalfEven,

    /// 禁止舍入，若存在舍入需求则报错
    ///
    /// ## Examples
    /// -  2.0  →  2
    /// -  2.1  →  error
    Unnecessary,
}
